# AceleraDev Codenation - Semana 2

### Túlio Vieira de Souza | Data Scientist

## Manipulando Dados (Pré-Processamento)

#### 1. Importando as Bibliotecas Necessárias

In [24]:
#Importing libraries
import pandas as pd
import numpy as np

In [25]:
#Acessing the help from pandas (pd) package
pd?

Type:        module
String form: <module 'pandas' from '/home/flavio/.local/lib/python3.9/site-packages/pandas/__init__.py'>
File:        ~/.local/lib/python3.9/site-packages/pandas/__init__.py
Docstring:
pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

#### 2. Manipulando Dicionários

In [8]:
#Creating a dictionary with data
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300 ,400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [9]:
#Showing the 'dados' dictionary created
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [10]:
#Checking the type from the variable 'dados'
type(dados)

dict

In [11]:
#Acessing the keys from the 'dados' dictionary
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [12]:
#Acessing a specific key in the 'dados' dictionary (In this case, the key 'site')
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [13]:
#Acessing a specific position from a specific key in the 'dados' dictionary (In this case, the position 2)
dados['acessos'][2]

300

In [14]:
#Acessing another specific position from a specific key in the 'dados' dictionary (In this case, the position 3)
dados['canal_venda'][3]

'linkedin'

In [15]:
#Acessing a specific positions from a specific key in the 'dados' dictionary (In this case, the positions 0, 1, 2)
dados['canal_venda'][:3]

['facebook', 'twitter', 'instagram']

#### 3. Manipulando Listas

In [16]:
#Creating a list named 'lista'
lista = [200, 200, 300, 800, 200]

In [17]:
#Checking the type from the 'lista' variable
type([1,2,3])

list

In [18]:
#Showing the 'lista' list
lista

[200, 200, 300, 800, 200]

In [19]:
#Picking a specific value from the 'lista' list
lista[1]

200

In [20]:
#Picking a slice of values from the 'lista list
lista[:4]

[200, 200, 300, 800]

In [21]:
#Adding the 'lista' list to the 'dados' dictionary
dados['lista'] = lista

In [22]:
#Showing the updated 'dados' dictionary
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

#### 4. Manipulando DataFrames

In [26]:
#Creating a dataframe named 'dataframe' from the 'dados' dictionary
dataframe = pd.DataFrame(dados)

In [27]:
#Showing the 'dataframe' dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [28]:
#Showing the 2 first rows from the 'dataframe' dataframe
dataframe.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200

In [29]:
#Checking the format (number of rows and columns) from the 'dataframe' dataframe
dataframe.shape

(5, 5)

In [30]:
#Checking the index from the 'dataframe' dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [31]:
#Checking the types from the data columns presenting in the 'dataframe' dataframe
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [32]:
#Counting the types from the data columns presenting in the 'dataframe' dataframe
dataframe.dtypes.value_counts()

object     2
int64      2
float64    1
dtype: int64

In [33]:
#Checking for NaN (Not a Number) values in the 'dataframe' dataframe
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [34]:
#Sum all the NaN (Not a Number) values in the columns from 'dataframe' dataframe
dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

In [35]:
#Showing the columns names from the 'dataframe' dataframe
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [36]:
#Showing a specific column from the 'dataframe' dataframe
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [37]:
#Creating and showing a new column in the 'dataframe' dataframe
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [38]:
#Showing the new columns names from the 'dataframe' dataframe
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [39]:
#Showing the 'dataframe' dataframe without some columns (In this case, the columns 'acessos', 'site', 'canal_venda)')
dataframe.drop(columns=['acessos', 'site', 'canal_venda'])

    vendas  lista  nova_coluna
0  1000.52    200            1
1  1052.34    200            2
2  2002.00    300            3
3  5000.00    800            4
4   300.00    200            5

In [40]:
#Removing the 'nova_coluna' column from the dataframe
dataframe.drop(columns='nova_coluna', inplace=True)
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [41]:
#Showing again the columns from the 'dataframe' dataframe
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [42]:
#Acessing a specific value from a specific column named 'acessos' in the 'dataframe' dataframe
dataframe['acessos'][1]

200

In [43]:
#Acessing a specific slice from a specific column named 'canal_venda' in the 'dataframe' datafrane
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [44]:
#Slicing the data from 'dataframe' dataframe with iloc[rows, columns]
dataframe.iloc[3:,:]

  canal_venda  acessos   site  vendas  lista
3    linkedin      400  site2  5000.0    800
4    facebook      500  site3   300.0    200

In [45]:
#Slicing the data from 'dataframe' dataframe with the index loc[rows]
dataframe.loc[:2]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300

In [46]:
#Showing specific columns from the 'dataframe' dataframe
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [47]:
#Passing a filter of the 'dataframe' dataframe in a list
filtro = ['canal_venda', 'acessos']

In [48]:
#Showing the 'dataframe' dataframe with the filter
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [49]:
#Using the info() method
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [50]:
#Showing the default 'dataframe' dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [51]:
#Pivoting the data in 'dataframe' dataframe
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

In [52]:
#Using the info() method in the 'aux' dataframe
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [53]:
#Completing the NaN values with the fillna method
#Pivoting the data from the 'aux' dataframe
aux = dataframe.pivot(index='canal_venda', columns='site', values='acessos').fillna(0)
dataframe.pivot(index='canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [54]:
#Changing the columns using the melt() function
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [55]:
#Reseting the index from the 'aux' dataframe
print(aux.columns)
aux = aux.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['canal_venda', 'site1', 'site2', 'site3'], dtype='object', name='site')

In [56]:
#Showing the new 'aux' dataframe
aux

site canal_venda  site1  site2  site3
0       facebook  100.0    0.0  500.0
1      instagram    0.0  300.0    0.0
2       linkedin    0.0  400.0    0.0
3        twitter  200.0    0.0    0.0

In [57]:
#Example of the melt() function
aux.melt(id_vars='canal_venda', value_vars=['site1', 'site2', 'site3'])

   canal_venda   site  value
0     facebook  site1  100.0
1    instagram  site1    0.0
2     linkedin  site1    0.0
3      twitter  site1  200.0
4     facebook  site2    0.0
5    instagram  site2  300.0
6     linkedin  site2  400.0
7      twitter  site2    0.0
8     facebook  site3  500.0
9    instagram  site3    0.0
10    linkedin  site3    0.0
11     twitter  site3    0.0

In [58]:
#Adding the columns from the 'dataframe' dataframe
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
dtype: object

In [59]:
#Adding the rows from the 'dataframe' dataframe
dataframe.sum(axis=1)

/tmp/ipykernel_4027/1243260411.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  dataframe.sum(axis=1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [60]:
#Showing the 'dataframe' dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [61]:
#Calculating the median (mediana) of numeric columns in the 'dataframe' dataframe
print('Row:\n', dataframe.median(axis=1))
print('Column:\n', dataframe.median())

Row:
 0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64
Column:
 acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

/tmp/ipykernel_4027/1188450998.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print('Row:\n', dataframe.median(axis=1))
/tmp/ipykernel_4027/1188450998.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print('Column:\n', dataframe.median())

In [62]:
#Calculating the mean (média) of numeric columns in the 'dataframe' dataframe
dataframe.mean()

/tmp/ipykernel_4027/2385205549.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [63]:
#Calculating the standard deviation (desvio padrão) of numeric columns in the 'dataframe' dataframe
dataframe.std()

/tmp/ipykernel_4027/2577316565.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [64]:
#Calculating the mode (moda) of numeric columns in the 'dataframe' dataframe
dataframe.mode()

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1   300.00  200.0
1         NaN      200  site2  1000.52    NaN
2         NaN      300    NaN  1052.34    NaN
3         NaN      400    NaN  2002.00    NaN
4         NaN      500    NaN  5000.00    NaN

In [65]:
#Calculating the descriptive statistics from the numeric columns in the 'dataframe' dataframe using describe()
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [66]:
#Calculating the maximum (máximo) value from each numeric columns in the 'dataframe' dataframe
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas          5000.0
lista              800
dtype: object

In [67]:
#Calculating the minimum (mínimo) value from each numeric columns in the 'dataframe' dataframe
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas            300.0
lista               200
dtype: object

In [68]:
#Showing the unique values from a specific column from the 'dataframe' dataframe
dataframe['site'].unique()

array(['site1', 'site2', 'site3'], dtype=object)

In [69]:
#Showing the number of unique values from each column in the 'dataframe' dataframe
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
dtype: int64

In [70]:
#Counting the unique values from a specific column from the 'dataframe' dataframe
dataframe['canal_venda'].value_counts()

facebook     2
twitter      1
instagram    1
linkedin     1
Name: canal_venda, dtype: int64

In [71]:
#Using groupby with the numeric values and sum
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [ ]:
#Using groupby with the numeric values and median
dataframe.groupby('canal_venda')['acessos'].median()

In [ ]:
#Using groupby with categories values and unique
dataframe.groupby('site')['canal_venda'].unique()

In [ ]:
#Using groupy with categories values and first
dataframe.groupby('site')['canal_venda'].first()

In [ ]:
#Using groupby with the aggregation function
dataframe.groupby('canal_venda').agg({'site':'unique', 'acessos':'sum'})

In [ ]:
#Correlation between variables (features)
dataframe.corr(method='spearman')

In [ ]:
#Showing the 'dataframe' dataframe
dataframe

In [ ]:
#Creating categorical variables by numeric variable slice
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                       bins= (0, 1500, 2000, 8000), 
                                       labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))
dataframe

In [ ]:
#Creating categorical variable using list compression
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]
dataframe

In [ ]:
#Creating a second dataframe
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [ ]:
#Merging the two dataframes ('dataframe' and 'dataframe_2')
dataframe.merge(dataframe_2, on='site', how='left')

#### 5. Manipulando Arquivos .csv

In [ ]:
#Saving the 'dataframe' dataframe as a .csv file
dataframe.to_csv('dataframe.csv', sep=';', decimal=',', index=False)

In [ ]:
#Reading the .csv file and saving in the 'dataframe_lido' dataframe
dataframe_lido = pd.read_csv('dataframe.csv', sep=';', decimal=',')

In [ ]:
#Showing the head from the 'dataframe_lido' dataframe
dataframe_lido.head()

In [ ]:
#Reading the 'train.csv' file
df = pd.read_csv('train.csv')
df

In [ ]:
#Creating a 'aux' dataframe with some characteristics from the 'train.csv' file 
aux = pd.DataFrame({'colunas': df.columns,
                    'tipos': df.dtypes,
                    'percentual_faltante': df.isna().sum() / df.shape[0]})
aux

In [ ]:
#Complete the NaN data on the numeric 'Age' column with the mode of the column
df['Age'] = df['Age'].fillna(df['Age'].mode())

In [ ]:
#Complete the NaN data on the categorical 'Cabin' column with 'Unknown'
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [ ]:
#Showing the sum of values from the 'Cabin' column
df['Cabin'].value_counts()

In [ ]:
#Showing the number of rows and columns from the 'df' dataframe
df.shape

#### 6. Manipulando Arquivos .json

In [ ]:
json = pd.read_json('https://pricing.us-east-1.amazonaws.com/offers/v1.0/aws/index.json')

In [ ]:
json.reset_index(inplace=True)

In [ ]:
json['offers'][99]

In [ ]:
json['index']